#pragma once
#include "pch.h"

inline void ProcessEvent(void* obj, void* function, void* parms)
{
	auto vtable = *reinterpret_cast<void***>(obj);
	reinterpret_cast<void(*)(void*, void*, void*)>(vtable[0x41])(obj, function, parms);
}

class UEngine;
class UObject;
class UWorld;
class UKismetSystemLibrary;

extern UEngine* GEngine;

template<class TEnum>
class TEnumAsByte
{
public:
	constexpr TEnumAsByte() noexcept {}

	constexpr TEnumAsByte(TEnum _value) noexcept :
		value(static_cast<uint8_t>(_value))
	{
	}

	constexpr explicit TEnumAsByte(int32_t _value) noexcept :
		value(static_cast<uint8_t>(_value))
	{
	}

	constexpr explicit TEnumAsByte(uint8_t _value) noexcept :
		value(_value)
	{
	}

	constexpr operator TEnum() const noexcept
	{
		return (TEnum)value;
	}

	constexpr TEnum GetValue() const noexcept
	{
		return (TEnum)value;
	}

private:
	std::uint8_t value;
};

class FScriptInterface
{
private:
	UObject* ObjectPointer;
	void* InterfacePointer;

public:
	inline UObject* GetObject() const
	{
		return ObjectPointer;
	}

	inline UObject*& GetObjectRef()
	{
		return ObjectPointer;
	}

	inline void* GetInterface() const
	{
		return ObjectPointer != nullptr ? InterfacePointer : nullptr;
	}
};

template<class InterfaceType>
class TScriptInterface : public FScriptInterface
{
public:
	inline InterfaceType* operator->() const
	{
		return (InterfaceType*)GetInterface();
	}

	inline InterfaceType& operator*() const
	{
		return *((InterfaceType*)GetInterface());
	}

	inline operator bool() const
	{
		return GetInterface() != nullptr;
	}
};

template<class T>
class TArray
{
	friend class FString;

public:
	constexpr TArray() noexcept
	{
		Data = nullptr;
		Count = Max = 0;
	};

	constexpr auto Num() const noexcept
	{
		return Count;
	};

	constexpr auto& operator[](std::int32_t i) noexcept
	{
		return Data[i];
	};

	constexpr const auto& operator[](std::int32_t i) const noexcept
	{
		return Data[i];
	};

	constexpr auto IsValidIndex(std::int32_t i) const noexcept
	{
		return i < Num();
	}

	T* Data;
	std::int32_t Count;
	std::int32_t Max;
};

class UObject;

class FUObjectItem
{
	enum class EInternalObjectFlags : std::int32_t
	{
		None = 0,
		ReachableInCluster = 1 << 23,
		ClusterRoot = 1 << 24,
		Native = 1 << 25,
		Async = 1 << 26,
		AsyncLoading = 1 << 27,
		Unreachable = 1 << 28,
		PendingKill = 1 << 29,
		RootSet = 1 << 30,
		GarbageCollectionKeepFlags = Native | Async | AsyncLoading,
		AllFlags = ReachableInCluster | ClusterRoot | Native | Async | AsyncLoading | Unreachable | PendingKill | RootSet,
	};

public:
	class UObject* Object;
	std::int32_t Flags;
	std::int32_t ClusterRootIndex;
	std::int32_t SerialNumber;
	char pad_0014[4];

	[[nodiscard]] constexpr auto IsUnreachable() const noexcept
	{
		return !!(Flags & static_cast<std::underlying_type_t<EInternalObjectFlags>>(EInternalObjectFlags::Unreachable));
	}

	[[nodiscard]] constexpr auto IsPendingKill() const noexcept
	{
		return !!(Flags & static_cast<std::underlying_type_t<EInternalObjectFlags>>(EInternalObjectFlags::PendingKill));
	}
};

class FChunkedFixedUObjectArray
{
public:
	enum
	{
		NumElementsPerChunk = 64 * 1024
	};

	constexpr auto Num() const noexcept
	{
		return NumElements;
	}

	constexpr auto GetObjectPtr(std::size_t Index) const noexcept
	{
		const auto ChunkIndex = Index / NumElementsPerChunk;
		const auto WithinChunkIndex = Index % NumElementsPerChunk;
		return Objects[ChunkIndex] + WithinChunkIndex;
	}

	constexpr auto* GetByIndex(std::size_t Index) const noexcept
	{
		return GetObjectPtr(Index);
	}

	UObject* FindObject(const std::string& name) const;

private:
	class FUObjectItem** Objects;
	class FUObjectItem* PreAllocatedObjects;
	std::int32_t MaxElements;
	std::int32_t NumElements;
	std::int32_t MaxChunks;
	std::int32_t NumChunks;
};

class FUObjectArray
{
public:
	std::int32_t ObjFirstGCIndex;
	std::int32_t ObjLastNonGCIndex;
	std::int32_t MaxObjectsNotConsideredByGC;
	bool OpenForDisregardForGC;
	FChunkedFixedUObjectArray ObjObjects;
};

class FWeakObjectPtr
{
public:
	[[nodiscard]] auto IsValid() const noexcept -> bool;
	[[nodiscard]] auto Get() const noexcept -> class UObject*;

	std::int32_t ObjectIndex;
	std::int32_t ObjectSerialNumber;
};

template<class T, class TWeakObjectPtrBase = FWeakObjectPtr>
struct TWeakObjectPtr : private TWeakObjectPtrBase
{
public:
	constexpr auto Get() const noexcept -> T*
	{
		return reinterpret_cast<T*>(TWeakObjectPtrBase::Get());
	}

	[[nodiscard]] constexpr auto& operator*() const noexcept
	{
		return *Get();
	}

	[[nodiscard]] constexpr auto operator->() const noexcept
	{
		return Get();
	}

	[[nodiscard]] constexpr auto IsValid() const noexcept
	{
		return TWeakObjectPtrBase::IsValid();
	}
};

class FNameEntry
{
public:
	constexpr auto GetAnsiName() const noexcept
	{
		return AnsiName;
	}

	constexpr auto GetWideName() const noexcept
	{
		return WideName;
	}

	inline bool IsWide() const
	{
		return (Index & 0x1);
	}

	inline std::wstring ToWString() const
	{
		std::wstring value;

		if (IsWide()) {
			std::wstring ws(GetWideName());
			value = ws;
		}
		else {
			std::string string = GetAnsiName();
			std::wstring ws(string.begin(), string.end());
			value = ws;
		}

		auto pos = value.rfind('/');
		if (pos != std::string::npos)
		{
			value = value.substr(pos + 1);
		}

		return value;
	}

	inline std::string ToString() const
	{
		std::string value;

		if (IsWide()) {
			std::wstring ws(GetWideName());
			std::string out(ws.begin(), ws.end());
			value = out;
		}
		else {
			value = GetAnsiName();
		}

		auto pos = value.rfind('/');
		if (pos != std::string::npos)
		{
			value = value.substr(pos + 1);
		}

		return value;
	}

private:
	std::int32_t Index; //0x0000
	char pad_0004[4]; //0x0004
	class FNameEntry* HashNext; //0x0008

	union
	{
		char AnsiName[1024];
		wchar_t WideName[1024];
	};
};

class TNameEntryArray
{
public:
	constexpr auto Num() const noexcept
	{
		return NumElements;
	}

	constexpr auto IsValidIndex(int Index) const noexcept
	{
		return Index < Num() && Index >= 0;
	}

	auto* operator[](int Index) const noexcept
	{
		return GetItemPtr(Index);
	}

	auto GetItem(int Index) const noexcept
	{
		return GetItemPtr(Index);
	}

private:
	enum
	{
		ElementsPerChunk = 16 * 1024,
		ChunkTableSize = (2 * 1024 * 1024 + ElementsPerChunk - 1) / ElementsPerChunk
	};

	FNameEntry* GetItemPtr(size_t Index) const noexcept
	{
		const auto ChunkIndex = Index / ElementsPerChunk;
		const auto WithinChunkIndex = Index % ElementsPerChunk;
		const auto Chunk = Chunks[ChunkIndex];
		return *(FNameEntry**)(Chunk + WithinChunkIndex);
	}

	FNameEntry** Chunks[ChunkTableSize];
	std::int32_t NumElements;
	std::int32_t NumChunks;
};

class FTextData
{
public:
	char UnknownData[0x28];
	wchar_t* Name;
	__int32 Length;
};

struct FText
{
	FTextData* Data;
	char UnknownData[0x10];

	wchar_t* Get() const {
		if (Data)
			return Data->Name;

		return nullptr;
	}
};

class FName
{
public:
	static inline TNameEntryArray* GNames = nullptr;
	std::int32_t ComparisonIndex;
	std::int32_t Number;

	inline FName()
		: ComparisonIndex(0),
		Number(0)
	{
	};

	inline FName(int32_t i)
		: ComparisonIndex(i),
		Number(0)
	{
	};

	FName(const char* nameToFind)
		: ComparisonIndex(0),
		Number(0)
	{
		static std::unordered_set<int> cache;

		for (auto i : cache)
		{
			auto currentName = GNames->GetItem(i);

			if (currentName != nullptr)
			{
				if (!std::strcmp(currentName->GetAnsiName(), nameToFind))
				{
					ComparisonIndex = i;

					return;
				}
			}
		}

		for (auto i = 0; i < GNames->Num(); ++i)
		{
			auto currentName = GNames->GetItem(i);

			if (currentName != nullptr)
			{
				if (!std::strcmp(currentName->GetAnsiName(), nameToFind))
				{
					cache.insert(i);

					ComparisonIndex = i;

					return;
				}
			}
		}
	};

	static TNameEntryArray* GetGlobalNames() noexcept
	{
		return GNames;
	};

	std::string GetString() const noexcept
	{
		auto name = GNames->GetItem(ComparisonIndex);

		return name->ToString();
	};

	std::wstring GetWString() const noexcept
	{
		auto name = GNames->GetItem(ComparisonIndex);

		return name->ToWString();
	};

	constexpr auto operator==(const FName& other) const noexcept
	{
		return ComparisonIndex == other.ComparisonIndex;
	};
};

class UClass;

class UObject
{
public:
	static inline FChunkedFixedUObjectArray* GObjects = nullptr;
	void** VTable;//0x00
	uint32_t ObjectFlags;//0x08
	uint32_t InternalIndex;//0x0C
	UClass* ClassPrivate;
	FName NamePrivate;
	UObject* OuterPrivate;

	std::string GetFullName() const;

	template<typename T>
	static T* FindObject(const std::string& name)
	{
		for (int i = 0; i < GObjects->Num(); ++i)
		{
			auto object = GObjects->GetByIndex(i)->Object;

			if (object == nullptr)
			{
				continue;
			}

			if (object->GetFullName() == name)
			{
				return static_cast<T*>(object);
			}
		}
		return nullptr;
	}

	template<typename T>
	static T* GetObjectByIndex(std::size_t Index)
	{
		for (int i = 0; i < GObjects->Num(); ++i)
		{
			auto object = GObjects->GetByIndex(i);

			return static_cast<T*>(object);
		}
		return nullptr;
	}

	bool IsA(UClass* cmp) const;
};

class UField : public UObject
{
public:
	UField* Next;
};

class UStruct : public UField
{
public:
	UStruct* SuperStruct; // 0x30(0x8)
	UField* Children; // 0x38(0x08)
	uint32_t PropertiesSize;// 0x40(0x04)
	char pad_0044[0x44]; // 0x54(0x88)
};

class UClass : public UStruct
{
public:
	char pad_00B0[0x180]; // 0xb0(0x180)
};

class FString : public TArray<wchar_t>
{
public:
	constexpr FString() noexcept {};

	constexpr FString(const wchar_t* other) noexcept
	{
		Max = Count = *other ? static_cast<std::int32_t>(std::wcslen(other)) + 1 : 0;

		if (Count)
			Data = const_cast<wchar_t*>(other);
	};

	constexpr auto IsValid() const noexcept
	{
		return Data != nullptr;
	}

	constexpr auto c_str() const noexcept
	{
		return Data;
	}

	std::string ToString() const noexcept
	{
		const auto length = std::wcslen(Data);
		std::string str(length, '\0');
		std::use_facet<std::ctype<wchar_t>>(std::locale()).narrow(Data, Data + length, '?', &str[0]);
		return str;
	}
};

struct FGbxAttributeFloat
{
	PAD(0x4);
	float Value;		// 0x0004(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float BaseValue;	// 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
};

struct FGbxAttributeInteger
{
	PAD(0x4);
	int Value;		// 0x0004(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int BaseValue;	// 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
};

// Class Engine.Texture
// 0x0090 (0x00B8 - 0x0028)
class UTexture : public UObject
{
public:
	PAD(0x90);

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;

		if (ptr == nullptr)
			ptr = UObject::FindObject<UClass>("Class Engine.Texture");

		return ptr;
	}
};

// Class Engine.TextureStreaming
// 0x0040 (0x00F8 - 0x00B8)
class UTextureStreaming : public UTexture
{
public:
	PAD(0x40);

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;

		if (ptr == nullptr)
			ptr = UObject::FindObject<UClass>("Class Engine.TextureStreaming");

		return ptr;
	}
};

// Class Engine.Texture2D
// 0x0008 (0x0100 - 0x00F8)
class UTexture2D : public UTextureStreaming
{
public:
	TEnumAsByte<ETextureAddress> AddressX;	// 0x00F8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ETextureAddress> AddressY;	// 0x00F9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	PAD(0x6);								// 0x00FA(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;

		if (ptr == nullptr)
			ptr = UObject::FindObject<UClass>("Class Engine.Texture2D");

		return ptr;
	}

	int Blueprint_GetSizeY()
	{
		static UObject* fn = nullptr;

		if (fn == nullptr)
			fn = UObject::FindObject<UObject>("Function Engine.Texture2D.Blueprint_GetSizeY");

		int ReturnValue;
		ProcessEvent(this, fn, &ReturnValue);

		return ReturnValue;
	}

	int Blueprint_GetSizeX()
	{
		static UObject* fn = nullptr;

		if (fn == nullptr)
			fn = UObject::FindObject<UObject>("Function Engine.Texture2D.Blueprint_GetSizeX");

		int ReturnValue;
		ProcessEvent(this, fn, &ReturnValue);

		return ReturnValue;
	}
};

// Class Engine.Font
// 0x01A8 (0x01D0 - 0x0028)
class UFont : public UObject
{
public:
	PAD(0x30);						// 0x0028(0x0008) MISSED OFFSET
	int IsRemapped;                 // 0x0058(0x0004) (ZeroConstructor, IsPlainOldData)
	float EmScale;					// 0x005C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float Ascent;					// 0x0060(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float Descent;					// 0x0064(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float Leading;					// 0x0068(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int Kerning;					// 0x006C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	PAD(0xB0);						// 0x0070(0x00B0) (Edit)
	int NumCharacters;				// 0x0120(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	PAD(0x4);						// 0x0124(0x0004) MISSED OFFSET
	TArray<int> MaxCharHeight;		// 0x0128(0x0010) (ZeroConstructor, Transient)
	float ScalingFactor;			// 0x0138(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int LegacyFontSize;				// 0x013C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class FName LegacyFontName;	// 0x0140(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	PAD(0x88);						// 0x0148(0x0038)
};

// Class Engine.ActorComponent
// 0x0150 (0x0178 - 0x0028)
class UActorComponent : public UObject
{
public:
	PAD(0x150);

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;

		if (ptr == nullptr)
			ptr = UObject::FindObject<UClass>("Class Engine.ActorComponent");

		return ptr;
	}

	class AActor* GetOwner()
	{
		static UObject* fn = nullptr;

		if (fn == nullptr)
			fn = UObject::FindObject<UObject>("Function Engine.ActorComponent.GetOwner");

		AActor* ReturnValue;
		ProcessEvent(this, fn, &ReturnValue);

		return ReturnValue;
	}
};

// Class OakGame.AIBalanceStateComponent
// 0x0160 (0x0338 - 0x01D8)
class UAIBalanceStateComponent : public UActorComponent
{
public:
	PAD(0x178);								// 0x01D8(0x0178) (Edit, ZeroConstructor)
	bool bIsAnointed;						// 0x02F0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	PAD(0x37);								// 0x02F1(0x0007) MISSED OFFSET
	EAnointedDeathState AnointedDeathState;	// 0x0328(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	PAD(0xF);								// 0x0329(0x000F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class OakGame.AIBalanceStateComponent");

		return ptr;
	}

	void ShatterFrozenAnointed()
	{
		static auto fn = UObject::FindObject<UObject>("Function OakGame.AIBalanceStateComponent.ShatterFrozenAnointed");

		struct {} param;

		ProcessEvent(this, fn, &param);
	}

};

// Class Engine.SceneComponent
// 0x0158 (0x02D0 - 0x0178)
class USceneComponent : public UActorComponent
{
public:
	PAD(0x74);							// 0x0178(0x0008) MISSED OFFSET
	class FVector RelativeLocation;	// 0x01EC(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net, IsPlainOldData)
	class FRotator RelativeRotation;	// 0x01F8(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net, IsPlainOldData)
	class FVector RelativeScale3D;		// 0x0204(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net, IsPlainOldData)
	PAD(0x30);							// 0x0210(0x0030) MISSED OFFSET
	class FVector ComponentVelocity;	// 0x0240(0x000C) (Transient, IsPlainOldData)
	PAD(0x84);							// 0x024C(0x0001) (Transient)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;

		if (ptr == nullptr)
			ptr = UObject::FindObject<UClass>("Class Engine.SceneComponent");

		return ptr;
	}
};

// Class GbxWeapon.GbxAmmoTypeData
// 0x0040 (0x0070 - 0x0030)
class UGbxAmmoTypeData
{
public:
	PAD(0x30);
	struct FText DisplayName;				// 0x0030(0x0028) (Edit, DisableEditOnInstance)
	class UTexture2D* DisplayIcon;			// 0x0048(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class FString ScaleformDisplayFrameID;	// 0x0050(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	PAD(0x8);								// 0x0060(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float RegenerationRate;					// 0x0068(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	PAD(0x4);								// 0x006C(0x0004) MISSED OFFSET
};


// Class GbxWeapon.WeaponAmmoComponent
// 0x0038 (0x01B0 - 0x0178)
class UWeaponAmmoComponent : public UActorComponent
{
public:
	PAD(0x8);								// 0x0178(0x0008) MISSED OFFSET
	class UGbxAmmoTypeData* AmmoTypeData;	// 0x0180(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	PAD(0x20);								// 0x0188(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	class AWeapon* WeaponPrivate;			// 0x01A8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;

		if (ptr == nullptr)
			ptr = UObject::FindObject<UClass>("Class GbxWeapon.WeaponAmmoComponent");

		return ptr;
	}
};

// Class Engine.Actor
// 0x0430 (0x0458 - 0x0028)
class AActor : public UObject
{
public:
	PAD(0x0140);												// 0x0028(0x0268)
	class USceneComponent* RootComponent;						// 0x0168(0x0008)
	PAD(0x01A0);												// 0x0170(0x0268)
	TArray<class UActorComponent*> InstanceComponents;			// 0x0310(0x0010) (ExportObject, ZeroConstructor)
	TArray<class UActorComponent*> BlueprintCreatedComponents;	// 0x0320(0x0010) (ExportObject, ZeroConstructor)
	PAD(0x0128);												// 0x0330(0x0100)

	class FRotator K2_GetActorRotation()
	{
		static UObject* fn = nullptr;

		if (fn == nullptr)
			fn = UObject::FindObject<UObject>("Function Engine.Actor.K2_GetActorRotation");

		FRotator rotation;
		ProcessEvent(this, fn, &rotation);

		return rotation;
	};

	class FVector K2_GetActorLocation()
	{
		static UObject* fn = nullptr;

		if (fn == nullptr)
			fn = UObject::FindObject<UObject>("Function Engine.Actor.K2_GetActorLocation");

		FVector location;
		ProcessEvent(this, fn, &location);

		return location;
	}

	bool K2_TeleportTo(const class FVector& DestLocation)
	{
		static UObject* fn = UObject::FindObject<UObject>("Function Engine.Actor.K2_TeleportTo");

		struct {
			FVector DestLocation;
			FRotator DestRotation;
			bool ReturnValue;
		} params;

		params = { DestLocation , K2_GetActorRotation(), false };

		ProcessEvent(this, fn, &params);

		return params.ReturnValue;
	}

	void SetActorEnableCollision(bool enableCollision)
	{
		static UObject* fn = nullptr;

		if (fn == nullptr)
			fn = UObject::FindObject<UObject>("Function Engine.Actor.SetActorEnableCollision");

		bool bNewActorEnableCollision = enableCollision;

		ProcessEvent(this, fn, &bNewActorEnableCollision);
	}

	bool GetActorEnableCollision()
	{
		static UObject* fn = nullptr;

		if (fn == nullptr)
			fn = UObject::FindObject<UObject>("Function Engine.Actor.GetActorEnableCollision");

		bool ReturnValue = false;

		ProcessEvent(this, fn, &ReturnValue);

		return ReturnValue;
	}

	class UActorComponent* GetComponentByClass(class UClass* ComponentClass)
	{
		static UObject* fn = nullptr;

		if (fn == nullptr)
			fn = UObject::FindObject<UObject>("Function Engine.Actor.GetComponentByClass");

		struct
		{
			UClass* ComponentClass;
			UActorComponent* ReturnValue;
		} params;

		params.ComponentClass = ComponentClass;

		ProcessEvent(this, fn, &params);

		return params.ReturnValue;
	}

	void DisableInput(class APlayerController* PlayerController)
	{
		static auto fn = UObject::FindObject<UObject>("Function Engine.Actor.DisableInput");

		struct
		{
			APlayerController* PlayerController;
		} params;

		ProcessEvent(this, fn, &params);
	}

	void EnableInput(class APlayerController* PlayerController)
	{
		static auto fn = UObject::FindObject<UObject>("Function Engine.Actor.EnableInput");

		struct
		{
			APlayerController* PlayerController;
		} params;

		ProcessEvent(this, fn, &params);
	}
};

// ScriptStruct Engine.HitResult
// 0x0090
struct FHitResult
{
	unsigned char bBlockingHit : 1;			// 0x0000(0x0001)
	unsigned char bStartPenetrating : 1;	// 0x0000(0x0001)
	PAD(0x3);		 						// 0x0001(0x0003) MISSED OFFSET
	int FaceIndex;							// 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char bLagCompensated : 1;		// 0x0008(0x0001)
	PAD(0x3);		 						// 0x0009(0x0003) MISSED OFFSET
	float Time;								// 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	float Distance;							// 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	class FVector Location;				// 0x0014(0x000C)
	class FVector ImpactPoint;				// 0x0020(0x000C)
	class FVector Normal;					// 0x002C(0x000C)
	class FVector ImpactNormal;			// 0x0038(0x000C)
	class FVector TraceStart;				// 0x0044(0x000C)
	class FVector TraceEnd;				// 0x0050(0x000C)                                         
	float PenetrationDepth;					// 0x005C(0x0004) (ZeroConstructor, IsPlainOldData)
	int Item;								// 0x0060(0x0004) (ZeroConstructor, IsPlainOldData)
	void* Physics;
	TWeakObjectPtr<class AActor>                       Actor;                                                    // 0x006C(0x0008) (ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class UPrimitiveComponent>          Component;                                                // 0x0074(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	PAD(0x4);								// 0x007C(0x0004) MISSED OFFSET
	//TWeakObjectPtr<class UPhysicalMaterial>            PhysMaterial;                                             // 0x0064(0x0008) (ZeroConstructor, IsPlainOldData)
	class FName BoneName;					// 0x0080(0x0008) (ZeroConstructor, IsPlainOldData)
	class FName MyBoneName;				// 0x0088(0x0008) (ZeroConstructor, IsPlainOldData)
};

// Class OakGame.InteractiveObject
// 0x00F8 (0x0550 - 0x0458)
class AInteractiveObject : public AActor
{
public:
	PAD(0xC0);													// 0x0458(0x0060) MISSED OFFSET
	class USkeletalMeshComponent* PrimarySkeletalMeshComponent;	// 0x0518(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	PAD(0x030);													// 0x0520(0x0060) MISSED OFFSET
};

// BlueprintGeneratedClass IO_Mayhem2_ArcaneEncanter.IO_Mayhem2_ArcaneEncanter_C
// 0x0118 (0x0668 - 0x0550)
class AIO_Mayhem2_ArcaneEncanter_C : public AInteractiveObject
{
public:
	PAD(0x20);								// 0x0550(0x0008) (Transient, DuplicateTransient)
	class USceneComponent* Sphere;			// 0x0570(0x0008) (Transient, DuplicateTransient)
	PAD(0x8);								// 0x0578(0x0008) (Transient, DuplicateTransient)
	class UDamageComponent* OakDamage;		// 0x0580(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	PAD(0x40);								// 0x0588(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	float Duration;							// 0x05C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	PAD(0x9C);								// 0x05CC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("BlueprintGeneratedClass IO_Mayhem2_ArcaneEncanter.IO_Mayhem2_ArcaneEncanter_C");

		return ptr;
	}

	void Explode()
	{
		static auto fn = UObject::FindObject<UObject>("Function IO_Mayhem2_ArcaneEncanter.IO_Mayhem2_ArcaneEncanter_C.Explode");

		struct {} param;

		ProcessEvent(this, fn, &param);
	}

};

// Class GbxInventory.InventoryCategoryData
// 0x0038 (0x0070 - 0x0038)
class UInventoryCategoryData
{
public:
	PAD(0x3A);                                  // 0x0038(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool SharedWithAllPlayers;					// 0x003A(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool bSharedPlayersMustBeOnFriendlyTeam;	// 0x003B(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool bLevelSyncPickupCurrency;				// 0x003C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool ManualActivation;						// 0x003D(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	PAD(0x2);                                   // 0x003E(0x0002) MISSED OFFSET
	struct FText CategoryDisplayName;			// 0x0040(0x0028) (Edit)
	bool bCanInspectItem;						// 0x0058(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool bCanInspectManufacturer;				// 0x0059(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool bCanInspectElementalEffects;			// 0x005A(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool bCanInspectParts;						// 0x005B(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool bCanChangeSkins;						// 0x005C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool bUseEquipAudioFromWeaponType;			// 0x005D(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool bDoNotUseCosmeticLabelInBackpackCells;	// 0x005E(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	PAD(0x11);                                  // 0x005F(0x0001) MISSED OFFSET
};

// Class GbxInventory.InventoryData
// 0x02D0 (0x0300 - 0x0030)
class UInventoryData
{
public:
	PAD(0x40);											// 0x0030(0x0008) MISSED OFFSET
	struct FText InventoryName;							// 0x0040(0x0028) (Edit, DisableEditOnTemplate)
	PAD(0x180);                                         // 0x0058(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate)
	class UInventoryCategoryData* InventoryCategory;	// 0x01D8(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	PAD(0x120);											// 0x01E0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
};

// Class GbxInventory.InventoryItemPickup
// 0x0190 (0x05E8 - 0x0458)
class AInventoryItemPickup : public AActor
{
public:
	PAD(0x30);												// 0x0458(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class USkeletalMeshComponent* PickupSkelMesh;			// 0x0488(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	PAD(0x10);												// 0x0490(0x0010) (ExportObject, ZeroConstructor, Transient)
	int Quantity;											// 0x04A0(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char bCanOnlyBePickedUpByOwnerController : 1;	// 0x04A4(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, Transient)
	unsigned char bHighDetail : 1;							// 0x04A4(0x0001) (Edit)
	unsigned char bSharedWithAllPlayers : 1;				// 0x04A4(0x0001) (Edit)
	unsigned char bSharedPlayersMustBeOnFriendlyTeam : 1;	// 0x04A4(0x0001) (Edit)
	unsigned char bReplicatePickupActor : 1;				// 0x04A4(0x0001) (Edit)
	unsigned char StaticPickup : 1;							// 0x04A4(0x0001) (Edit)
	unsigned char bUseInventoryDataPickupActionType : 1;	// 0x04A4(0x0001) (Edit)
	PAD(0xB);												// 0x04A5(0x0003) MISSED OFFSET
	float MaxDrawDistance;									// 0x04B0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	PAD(0xC);												// 0x04B4(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	class UInventoryCategoryData* PickupCategory;			// 0x04C0(0x0008) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData)
	PAD(0x40);												// 0x04C8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class FVector StaticLocation;							// 0x0508(0x000C) (IsPlainOldData)
	class FRotator StaticRotation;							// 0x0514(0x000C) (IsPlainOldData)
	bool NotAddedToInventory;								// 0x0520(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	PAD(0x3);												// 0x0521(0x0003) MISSED OFFSET
	float PickupSphereRadius;								// 0x0524(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float PickupSphereRadiusHideScale;						// 0x0528(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	PAD(0xC);												// 0x052C(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UInventoryData* AssociatedInventoryData;			// 0x0538(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	PAD(0x68);												// 0x0540(0x0028) (BlueprintVisible, BlueprintReadOnly, Transient)
	unsigned char bIsActive : 1;							// 0x05A8(0x0001) (BlueprintVisible, BlueprintReadOnly, Net)
	PAD(0x3F);												// 0x05A9(0x0003) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;

		if (ptr == nullptr)
			ptr = UObject::FindObject<UClass>("Class GbxInventory.InventoryItemPickup");

		return ptr;
	}

	FLinearColor GetInventoryRarityColorOutline()
	{
		static UObject* fn = nullptr;

		if (fn == nullptr)
			fn = UObject::FindObject<UObject>("Function GbxInventory.InventoryItemPickup.GetInventoryRarityColorOutline");

		FLinearColor ReturnValue;

		ProcessEvent(this, fn, &ReturnValue);

		return ReturnValue;
	}

	FLinearColor GetInventoryRarityColorFX()
	{
		static UObject* fn = nullptr;

		if (fn == nullptr)
			fn = UObject::FindObject<UObject>("Function GbxInventory.InventoryItemPickup.GetInventoryRarityColorFX");

		FLinearColor ReturnValue;

		ProcessEvent(this, fn, &ReturnValue);

		return ReturnValue;
	}
};

// Class GbxInventory.DroppedInventoryItemPickup
// 0x0078 (0x0660 - 0x05E8)
class ADroppedInventoryItemPickup : public AInventoryItemPickup
{
public:
	PAD(0x24);				// 0x05E8(0x000C) (Transient)
	int DroppedQuantity;	// 0x060C(0x0004) (Net, ZeroConstructor, Transient, IsPlainOldData)
	PAD(0x50);				// 0x0610(0x0004) (Net, ZeroConstructor, Transient, IsPlainOldData)
};

// Class GbxInventory.InventoryRarityData
// 0x0118 (0x0148 - 0x0030)
class UInventoryRarityData
{
public:
	PAD(0x30);								// 0x0000(0x0030) (Edit, IsPlainOldData)
	class FLinearColor RarityColorFX;		// 0x0030(0x0010) (Edit, IsPlainOldData)
	class FLinearColor RarityColorOutline;	// 0x0040(0x0010) (Edit, IsPlainOldData)
	int RarityOutlineDepthStencilValue;		// 0x0050(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool DisplayRarityOutline;				// 0x0054(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	PAD(0x1B);								// 0x0055(0x0003) MISSED OFFSET
	struct FText RarityDisplayname;			// 0x0070(0x0028) (Edit)
	int RaritySortValue;					// 0x0088(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	PAD(0x4);								// 0x008C(0x0004) MISSED OFFSET
	float RarityLootBeamHeight;				// 0x00A0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	PAD(0xA4);								// 0x00A4(0x0004) MISSED OFFSET
};

// Class OakGame.OakInventoryItemPickup
// 0x00C8 (0x0728 - 0x0660)
class AOakInventoryItemPickup : public ADroppedInventoryItemPickup
{
public:
	PAD(0xB0);													// 0x0660(0x0018) MISSED OFFSET
	class UInventoryRarityData* AssociatedInventoryRarityData;	// 0x0710(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	PAD(0x10);													// 0x0718(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;

		if (ptr == nullptr)
			ptr = UObject::FindObject<UClass>("Class OakGame.OakInventoryItemPickup");

		return ptr;
	}
};

// BlueprintGeneratedClass BP_OakInventoryItemPickup.BP_OakInventoryItemPickup_C
// 0x0008 (0x0730 - 0x0728)
class ABP_OakInventoryItemPickup_C : public AOakInventoryItemPickup
{
public:
	PAD(0x8);	// 0x0728(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;

		if (ptr == nullptr)
			ptr = UObject::FindObject<UClass>("BlueprintGeneratedClass BP_OakInventoryItemPickup.BP_OakInventoryItemPickup_C");

		return ptr;
	}
};

// BlueprintGeneratedClass BP_OakWeaponPickup.BP_OakWeaponPickup_C
// 0x0000 (0x0730 - 0x0730)
class ABP_OakWeaponPickup_C : public ABP_OakInventoryItemPickup_C
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;

		if (ptr == nullptr)
			ptr = UObject::FindObject<UClass>("BlueprintGeneratedClass BP_OakWeaponPickup.BP_OakWeaponPickup_C");

		return ptr;
	}

};

// BlueprintGeneratedClass BP_OakConsumableItemPickup.BP_OakConsumableItemPickup_C
// 0x0008 (0x0738 - 0x0730)
class ABP_OakConsumableItemPickup_C : public ABP_OakInventoryItemPickup_C
{
public:
	PAD(0x8);	// 0x0730(0x0008) (Transient, DuplicateTransient)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;

		if (ptr == nullptr)
			ptr = UObject::FindObject<UClass>("BlueprintGeneratedClass BP_OakConsumableItemPickup.BP_OakConsumableItemPickup_C");

		return ptr;
	}
};

// Class Engine.PrimitiveComponent
// 0x0420 (0x06F0 - 0x02D0)
class UPrimitiveComponent : public USceneComponent
{
public:
	PAD(0x0420);
};

// Class Engine.ModelComponent
// 0x0040 (0x0730 - 0x06F0)
class UModelComponent : public UPrimitiveComponent
{
public:
	PAD(0x40);
};

// Class Engine.Level
// 0x02F8 (0x0320 - 0x0028)
class ULevel : public UObject
{
public:
	PAD(0x78);										// 0x0028(0x0078)
	TArray<class AActor*> Actors;					// 0x00A0(0x0010)
	TArray<class UModelComponent*> ModelComponents;	// 0x00B0(0x0078)
	PAD(0x260);										// 0x00C0(0x0270)
};

// Class Engine.PlayerState
// 0x00D0 (0x0528 - 0x0458)
class APlayerState// : public AInfo
{
public:
	PAD(0x0458);
	float Score;						// 0x0458(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char Ping;					// 0x045C(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	PAD(0x3);							// 0x045D(0x0003) MISSED OFFSET
	class FString PlayerName;			// 0x0460(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	PAD(0x088);							// 0x0470(0x0010) MISSED OFFSET
	class FString PlayerNamePrivate;	// 0x04F8(0x0010) (Net, ZeroConstructor)
	PAD(0x020);							// 0x0508(0x0010) MISSED OFFSET
};

// Class Engine.GameModeBase
// 0x00A8 (0x0500 - 0x0458)
class AGameModeBase
{
public:
	PAD(0x458);						// 0x0000
	class FString OptionsString;	// 0x0458(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	PAD(0x20);						// 0x0468(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass* HUDClass;			// 0x0488(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	PAD(0x70);						// 0x0490(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// Class Engine.GameMode
// 0x0048 (0x0548 - 0x0500)
class AGameMode : public AGameModeBase
{
public:
	class FName MatchState;            // 0x0500(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char bDelayedStart : 1;	// 0x0508(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	PAD(0x3);							// 0x0509(0x0003) MISSED OFFSET
	int NumSpectators;                  // 0x050C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int NumPlayers;                     // 0x0510(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int NumBots;                        // 0x0514(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float MinRespawnDelay;              // 0x0518(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int NumTravellingPlayers;           // 0x051C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	PAD(0x1);                           // 0x0520(0x0008) (ZeroConstructor, IsPlainOldData)
};

// Class Engine.GameStateBase
// 0x00C8 (0x0520 - 0x0458)
class AGameStateBase// : public AInfo
{
public:
	PAD(0x460);									// 0x0458(0x0008)
	class AGameModeBase* AuthorityGameMode;		// 0x0460(0x0008)
	PAD(0x8);									// 0x0468(0x0008)
	TArray<class APlayerState*> PlayerArray;	// 0x0470(0x0010)
	PAD(0xA0);									// 0x0480(0x00A0)
};

// Class Engine.Pawn
// 0x0068 (0x04C0 - 0x0458)
class APawn : public AActor
{
public:
	PAD(0x0068); //0x0458
};

// Class Engine.SkeletalMeshComponent
// 0x04F0 (0x0F20 - 0x0A30)
class USkeletalMeshComponent
{
public:
	PAD(0x728);													// 0x0A30(0x0008) MISSED OFFSET	
	TArray<class FTransform> ATransform;
	TArray<class FTransform> BTransform;
	TArray<class FTransform> CTransform;
	TArray<class FTransform> DTransform;						// 0x0758(0x0010) MISSED OFFSET
	PAD(0x320);
	TArray<class FTransform> ETransform;						// 0x0A88(0x0010) MISSED OFFSET
	PAD(0x38);													// 0x0A98(0x0038) MISSED OFFSET
	TArray<class FTransform> CachedBoneSpaceTransforms;		// 0x0AD0(0x0010) (ZeroConstructor, Transient)
	TArray<class FTransform> CachedComponentSpaceTransforms;	// 0x0AE0(0x0010) (ZeroConstructor, Transient)
	PAD(0x430);													// 0x0AF0(0x0430) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;

		if (ptr == nullptr)
			ptr = UObject::FindObject<UClass>("Class Engine.SkeletalMeshComponent");

		return ptr;
	}

	FName GetBoneName(int boneIndex)
	{
		static UObject* fn = nullptr;

		if (fn == nullptr)
			fn = UObject::FindObject<UObject>("Function Engine.SkinnedMeshComponent.GetBoneName");

		struct {
			int BoneIndex;
			PAD(0x4);
			FName ReturnValue;
		} params;

		params = { boneIndex };

		ProcessEvent(this, fn, &params);

		return params.ReturnValue;
	}

	int GetBoneIndex(const class FName& BoneName)
	{
		static UObject* fn = nullptr;

		if (fn == nullptr)
			fn = UObject::FindObject<UObject>("Function Engine.SkinnedMeshComponent.GetBoneIndex");

		struct {
			FName BoneName;
			int ReturnValue;
		} params;

		params = { BoneName };

		ProcessEvent(this, fn, &params);

		return params.ReturnValue;
	}

	FTransform K2_GetComponentToWorld()
	{
		static UObject* fn = nullptr;

		if (fn == nullptr)
			fn = UObject::FindObject<UObject>("Function Engine.SceneComponent.K2_GetComponentToWorld");

		FTransform CompToWorld;
		ProcessEvent(this, fn, &CompToWorld);
		return CompToWorld;
	}

	bool GetBoneByName(FName boneName, const FMatrix& componentToWorld, FVector& pos)
	{
		auto boneIndex = GetBoneIndex(boneName);

		if (boneIndex >= ATransform.Num())
			return false;

		const auto& bone = ATransform[boneIndex];
		auto boneMatrix = bone.ToMatrixWithScale();
		auto world = boneMatrix * componentToWorld;

		pos =
		{
			world.M[3][0],
			world.M[3][1],
			world.M[3][2]
		};

		return true;
	}

	bool GetBone(const uint32_t id, const FMatrix& componentToWorld, FVector& pos)
	{
		if (id >= ATransform.Num())
			return false;

		const auto& bone = ATransform[id];
		auto boneMatrix = bone.ToMatrixWithScale();
		auto world = boneMatrix * componentToWorld;

		pos =
		{
			world.M[3][0],
			world.M[3][1],
			world.M[3][2]
		};

		return true;
	}
};

// ScriptStruct GbxGameSystemCore.DamageInfo
// 0x0058
struct FDamageInfo
{
	float Damage;							// 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	PAD(0x14);								// 0x0004(0x0004) MISSED OFFSET
	float DamageRadius;						// 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float ImpactForce;						// 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	PAD(0x28);								// 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	bool bApplyCriticalHitModsToAoEDamage;	// 0x0048(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	PAD(0xF);								// 0x0049(0x0003) MISSED OFFSET
};

// Class Engine.MovementComponent
// 0x0048 (0x01C0 - 0x0178)
class UMovementComponent : public UActorComponent
{
public:
	class USceneComponent* UpdatedComponent;	// 0x0178(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData)
	PAD(0xC);									// 0x0180(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData)
	class FVector Velocity;					// 0x018C(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	PAD(0x28);									// 0x0198(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;

		if (ptr == nullptr)
			ptr = UObject::FindObject<UClass>("Class Engine.MovementComponent");

		return ptr;
	}
};

struct FMovementProperties
{
	unsigned char                                      bCanCrouch : 1;                                           // 0x0000(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bCanJump : 1;                                             // 0x0000(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bCanWalk : 1;                                             // 0x0000(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bCanSwim : 1;                                             // 0x0000(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bCanFly : 1;                                              // 0x0000(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
};

// Class Engine.NavMovementComponent
// 0x0048 (0x0208 - 0x01C0)
class UNavMovementComponent : public UMovementComponent
{
public:
	PAD(0x40);									// 0x01C0(0x0030) (Edit, BlueprintVisible)
	struct FMovementProperties MovementState;	// 0x0200(0x0004)
	PAD(0x4);									// 0x0204(0x0004) MISSED OFFSET
};

// Class Engine.PawnMovementComponent
// 0x0008 (0x0210 - 0x0208)
class UPawnMovementComponent : public UNavMovementComponent
{
public:
	class APawn* PawnOwner;                                                // 0x0208(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)

	class FVector K2_GetInputVector()
	{
		static UObject* fn = nullptr;

		if (fn == nullptr)
			fn = UObject::FindObject<UObject>("Function Engine.PawnMovementComponent.K2_GetInputVector");

		FVector params;

		ProcessEvent(this, fn, &params);

		return params;
	}

	void AddInputVector(const class FVector& WorldVector, bool bForce)
	{
		static UObject* fn = nullptr;

		if (fn == nullptr)
			fn = UObject::FindObject<UObject>("Function Engine.PawnMovementComponent.AddInputVector");

		struct {
			FVector WorldVector;
			bool bForce;
		} params;

		params = { WorldVector, bForce };

		ProcessEvent(this, fn, &params);
	}
};


// Class Engine.ProjectileMovementComponent
// 0x0098 (0x0258 - 0x01C0)
class UProjectileMovementComponent : public UMovementComponent
{
public:
	PAD(0x1C0);
	float          InitialSpeed;                            // 0x01C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float          MaxSpeed;                                // 0x01C4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char  bRotationFollowsVelocity : 1;            // 0x01C8(0x0001) (Edit, BlueprintVisible)
	unsigned char  bShouldBounce : 1;                       // 0x01C8(0x0001) (Edit, BlueprintVisible)
	unsigned char  bInitialVelocityInLocalSpace : 1;        // 0x01C8(0x0001) (Edit, BlueprintVisible)
	unsigned char  bForceSubStepping : 1;                   // 0x01C8(0x0001) (Edit, BlueprintVisible)
	unsigned char  bIsHomingProjectile : 1;                 // 0x01C8(0x0001) (Edit, BlueprintVisible)
	unsigned char  bBounceAngleAffectsFriction : 1;         // 0x01C8(0x0001) (Edit, BlueprintVisible)
	unsigned char  bIsSliding : 1;                          // 0x01C8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst)
	unsigned char  UnknownData00[0x3];                      // 0x01C9(0x0003) MISSED OFFSET
	float          PreviousHitTime;                         // 0x01CC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	class FVector PreviousHitNormal;                       // 0x01D0(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, IsPlainOldData)
	float          ProjectileGravityScale;                  // 0x01DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float          Buoyancy;                                // 0x01E0(0x0004) (ZeroConstructor, IsPlainOldData)
	float          Bounciness;                              // 0x01E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float          Friction;                                // 0x01E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float          BounceVelocityStopSimulatingThreshold;   // 0x01EC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	PAD(0x68);												// 0x01F0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
};

// Class GbxWeapon.GbxProjectileMovementComponent
// 0x0070 (0x02C8 - 0x0258)
class UGbxProjectileMovementComponent : public UProjectileMovementComponent
{
public:
	PAD(0x70);
};

// Class GbxGameSystemCore.UseComponent
// 0x0428 (0x05A0 - 0x0178)
class UUseComponent : public UActorComponent
{
public:
	PAD(0x50);								// 0x0178(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float ViewDistance;                     // 0x01C8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float InteractDistance;                 // 0x01CC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float LeaveInteractionDistance;         // 0x01D0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float VehicleInteractDistance;          // 0x01D4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float VehicleLeaveInteractionDistance;	// 0x01D8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	PAD(0x3C4);								// 0x01DC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;

		if (ptr == nullptr)
			ptr = UObject::FindObject<UClass>("Class GbxGameSystemCore.UseComponent");

		return ptr;
	}
};

// Class GbxGameSystemCore.ExplosionComponent
// 0x0060 (0x01D8 - 0x0178)
class UExplosionComponent : public UActorComponent
{
public:
	struct FGbxAttributeFloat ExplosionRadius;	// 0x0178(0x000C) (Edit, BlueprintVisible)
	PAD(0x4);									// 0x0184(0x0004) MISSED OFFSET
};

// Class Engine.CharacterMovementComponent
// 0x0680 (0x0890 - 0x0210)
class UCharacterMovementComponent : public UPawnMovementComponent
{
public:
	PAD(0x64);							// 0x0210(0x0010) MISSED OFFSET
	struct FGbxAttributeFloat                          MaxWalkSpeed;                                             // 0x0274(0x000C) (Edit, BlueprintVisible, Net)
	struct FGbxAttributeFloat                          MaxWalkSpeedCrouched;                                     // 0x0280(0x000C) (Edit, BlueprintVisible, Net)
	struct FGbxAttributeFloat                          MaxSwimSpeed;                                             // 0x028C(0x000C) (Edit, BlueprintVisible, Net)
	struct FGbxAttributeFloat                          MaxFlySpeed;                                              // 0x0298(0x000C) (Edit, BlueprintVisible, Net)
	struct FGbxAttributeFloat                          MaxCustomMovementSpeed;                                   // 0x02A4(0x000C) (Edit, BlueprintVisible, Net)
	float                                              MaxAcceleration;                                          // 0x02B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	PAD(0x9C);                                       // 0x02B4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class FVector                                     Acceleration;                                             // 0x0350(0x000C) (IsPlainOldData)
	PAD(0x4E4);                                       // 0x035C(0x000C) (IsPlainOldData)
	float                                              WalkableLedgeAngle;                                       // 0x0840(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              WalkableLedgeZ;                                           // 0x0844(0x0004) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	PAD(0x48);                                      // 0x0848(0x0047) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;

		if (ptr == nullptr)
			ptr = UObject::FindObject<UClass>("Class Engine.CharacterMovementComponent");

		return ptr;
	}

	void SetMovementMode(TEnumAsByte<EMovementMode> NewMovementMode, unsigned char NewCustomMode)
	{
		static UObject* fn = nullptr;

		if (fn == nullptr)
			fn = UObject::FindObject<UObject>("Function Engine.CharacterMovementComponent.SetMovementMode");

		struct {
			TEnumAsByte<EMovementMode> NewMovementMode;
			unsigned char NewCustomMode;
		} params;

		params = { NewMovementMode, NewCustomMode };

		ProcessEvent(this, fn, &params);
	}
};

// ScriptStruct OakGame.CharacterJumpGoalSetting
// 0x000C
struct FCharacterJumpGoalSetting
{
	float InitialZVelocity;                                         // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float GoalHeight;                                               // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char bUseInitialZVelocity : 1;                                 // 0x0008(0x0001) (Edit, BlueprintVisible)
	unsigned char bUseGoalHeight : 1;                                       // 0x0008(0x0001) (Edit, BlueprintVisible)
	PAD(0x3);                                       // 0x0009(0x0003) MISSED OFFSET
};

// Class GbxGameSystemCore.GbxCharacterMovementComponent
// 0x1DF0 (0x2680 - 0x0890)
class UGbxCharacterMovementComponent : public UCharacterMovementComponent
{
public:
	PAD(0x8AC);                                     // 0x0890(0x0748) MISSED OFFSET
	struct FGbxAttributeFloat                          MaxLadderAscendSpeed;                                     // 0x113C(0x000C) (Edit, BlueprintVisible, Net)
	struct FGbxAttributeFloat                          MaxLadderDescendSpeed;                                    // 0x1148(0x000C) (Edit, BlueprintVisible, Net)
	PAD(0xFB0);                                    // 0x1154(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AirFriction;                                              // 0x2104(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	PAD(0x578);                           // 0x2108(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
};

// Class GbxNav.GbxNavCharacterMovementComponent
// 0x0210 (0x2890 - 0x2680)
class UGbxNavCharacterMovementComponent : public UGbxCharacterMovementComponent
{
public:
	PAD(0x210);
};


// Class OakGame.OakCharacterMovementComponent
// 0x0700 (0x2F90 - 0x2890)
class UOakCharacterMovementComponent : public UGbxNavCharacterMovementComponent
{
public:
	float                                              MaxInheritedSpeedFromSimulatingPhysicsMovementBase;       // 0x2890(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bUseJumpGoals;                                            // 0x2894(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x2895(0x0003) MISSED OFFSET
	float                                              SprintingJumpMaxSpeedPct;                                 // 0x2898(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SprintingJumpHorizontalSpeedScale;                        // 0x289C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FCharacterJumpGoalSetting                   JumpGoal_Default;                                         // 0x28A0(0x000C) (Edit, BlueprintVisible)
	struct FCharacterJumpGoalSetting                   JumpGoal_Sprinting;                                       // 0x28AC(0x000C) (Edit, BlueprintVisible)
	float                                              JumpHorizontalSpeedScaleWhenNoAcceleration;               // 0x28B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FallDelayTime;                                            // 0x28BC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FallDelayGravityScale;                                    // 0x28C0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              JumpQueueTime;                                            // 0x28C4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x28C8(0x0004) MISSED OFFSET
	struct FGbxAttributeFloat                          MaxSprintSpeed;                                           // 0x28CC(0x000C) (Edit, BlueprintVisible, Net)
	struct FGbxAttributeFloat                          MaxInjuredSprintSpeed;                                    // 0x28D8(0x000C) (Edit, BlueprintVisible, Net)
	struct FGbxAttributeFloat                          MaxWalkSpeedInjured;                                      // 0x28E4(0x000C) (Edit, BlueprintVisible, Net)
	struct FGbxAttributeFloat                          MaxWalkSpeedInjuredBeingRevived;                          // 0x28F0(0x000C) (Edit, BlueprintVisible, Net)
	float                                              MaxSprintAngle;                                           // 0x28FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SprintAnalogInputThreshold;                               // 0x2900(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	PAD(0x68C);                      // 0x2904(0x0001) (Edit, BlueprintVisible)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;

		if (ptr == nullptr)
			ptr = UObject::FindObject<UClass>("Class OakGame.OakCharacterMovementComponent");

		return ptr;
	}
};

// Class GbxWeapon.RecoilControlComponent
// 0x0060 (0x01D8 - 0x0178)
class URecoilControlComponent : public UActorComponent
{
public:
	PAD(0x24);									// 0x0178(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class FRotator CurrentRotation;			// 0x019C(0x000C) (Transient, IsPlainOldData)
	class FRotator TargetRotation;				// 0x01A8(0x000C) (Transient, IsPlainOldData)
	class FRotator InputPassthroughThreshold;	// 0x01B4(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	PAD(0x18);									// 0x01C0(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;

		if (ptr == nullptr)
			ptr = UObject::FindObject<UClass>("Class GbxWeapon.RecoilControlComponent");

		return ptr;
	}
};

// Class GbxWeapon.WeaponReloadComponent
// 0x0060 (0x01D8 - 0x0178)
class UWeaponReloadComponent : public UActorComponent
{
public:
	PAD(0x48);								// 0x0178(0x0010) MISSED OFFSET
	struct FGbxAttributeFloat ReloadTime;	// 0x01C0(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net)
	PAD(0xC);								// 0x01CC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindObject<UClass>("Class GbxWeapon.WeaponReloadComponent");

		return ptr;
	}
};

// Class GbxWeapon.WeaponRecoilComponent
// 0x0020 (0x0198 - 0x0178)
class UWeaponRecoilComponent : public UActorComponent
{
public:
	PAD(0x10);                                      // 0x0178(0x0010) MISSED OFFSET
	class URecoilControlComponent* CachedControlComponent;                                   // 0x0188(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class AWeapon* WeaponPrivate;                                            // 0x0190(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr;

		if (ptr == nullptr)
			ptr = UObject::FindObject<UClass>("Class GbxWeapon.WeaponRecoilComponent");

		return ptr;
	}
};

// Class OakGame.SwayPatternData
// 0x0018 (0x0048 - 0x0030)
class USwayPatternData
{
public:
	PAD(0x30);
	TArray<class FVector2D>                           Samples;                                                  // 0x0030(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, EditConst)
	int                                                NumberOfOctaves;                                          // 0x0040(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                NumberOfSamplesToGenerate;                                // 0x0044(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// Class OakGame.WeaponSwayComponent
// 0x00F0 (0x0268 - 0x0178)
class UWeaponSwayComponent : public UActorComponent
{
public:
	PAD(0x10);                                        // 0x0178(0x0010) MISSED OFFSET
	class USwayPatternData* Pattern;                                                  // 0x0188(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FGbxAttributeFloat                          Scale;                                                    // 0x0190(0x000C) (Edit, Net)
	struct FGbxAttributeFloat                          AccuracyScale;                                            // 0x019C(0x000C) (Edit, Net)
	float                                              Speed;                                                    // 0x01A8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Lacunarity;                                               // 0x01AC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Persistence;                                              // 0x01B0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DiscWidth;                                                // 0x01B4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DiscHeight;                                               // 0x01B8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FGbxAttributeFloat                          ZoomScale;                                                // 0x01BC(0x000C) (Edit, Net)
	struct FGbxAttributeFloat                          ZoomAccuracyScale;                                        // 0x01C8(0x000C) (Edit, Net)
	float                                              ZoomSmoothingSpeed;                                       // 0x01D4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
